tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1936_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1936_H_
#define _PIC16LF1936_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define PORTC                         53
#define RC0                           54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTE                         62
#define RE3                           63
#define PIR1                          64
#define TMR1IF                        65
#define TMR2IF                        66
#define CCP1IF                        67
#define SSPIF                         68
#define TXIF                          69
#define RCIF                          70
#define ADIF                          71
#define TMR1GIF                       72
#define PIR2                          73
#define CCP2IF                        74
#define LCDIF                         75
#define BCLIF                         76
#define EEIF                          77
#define C1IF                          78
#define C2IF                          79
#define OSFIF                         80
#define PIR3                          81
#define TMR4IF                        82
#define TMR6IF                        83
#define CCP3IF                        84
#define CCP4IF                        85
#define CCP5IF                        86
#define TMR0                          87
#define TMR1L                         88
#define TMR1H                         89
#define T1CON                         90
#define TMR1ON                        91
#define nT1SYNC                       92
#define T1OSCEN                       93
#define T1CKPS0                       94
#define T1CKPS                        95
#define T1CKPS1                       96
#define TMR1CS                        97
#define TMR1CS0                       98
#define TMR1CS1                       99
#define T1GCON                        100
#define T1GSS0                        101
#define T1GSS                         102
#define T1GSS1                        103
#define T1GVAL                        104
#define T1GGO_nDONE                   105
#define T1GGO                         106
#define T1GSPM                        107
#define T1GTM                         108
#define T1GPOL                        109
#define TMR1GE                        110
#define TMR2                          111
#define PR2                           112
#define T2CON                         113
#define T2CKPS0                       114
#define T2CKPS                        115
#define T2CKPS1                       116
#define TMR2ON                        117
#define T2OUTPS0                      118
#define T2OUTPS                       119
#define T2OUTPS1                      120
#define T2OUTPS2                      121
#define T2OUTPS3                      122
#define CPSCON0                       123
#define T0XCS                         124
#define CPSOUT                        125
#define CPSRNG                        126
#define CPSRNG0                       127
#define CPSRNG1                       128
#define CPSON                         129
#define CPSCON1                       130
#define CPSCH                         131
#define CPSCH0                        132
#define CPSCH1                        133
#define CPSCH2                        134
#define TRISA                         135
#define TRISA0                        136
#define TRISA1                        137
#define TRISA2                        138
#define TRISA3                        139
#define TRISA4                        140
#define TRISA5                        141
#define TRISA6                        142
#define TRISA7                        143
#define TRISB                         144
#define TRISB0                        145
#define TRISB1                        146
#define TRISB2                        147
#define TRISB3                        148
#define TRISB4                        149
#define TRISB5                        150
#define TRISB6                        151
#define TRISB7                        152
#define TRISC                         153
#define TRISC0                        154
#define TRISC1                        155
#define TRISC2                        156
#define TRISC3                        157
#define TRISC4                        158
#define TRISC5                        159
#define TRISC6                        160
#define TRISC7                        161
#define TRISE                         162
#define TRISE3                        163
#define PIE1                          164
#define TMR1IE                        165
#define TMR2IE                        166
#define CCP1IE                        167
#define SSPIE                         168
#define TXIE                          169
#define RCIE                          170
#define ADIE                          171
#define TMR1GIE                       172
#define PIE2                          173
#define CCP2IE                        174
#define LCDIE                         175
#define BCLIE                         176
#define EEIE                          177
#define C1IE                          178
#define C2IE                          179
#define OSFIE                         180
#define PIE3                          181
#define TMR4IE                        182
#define TMR6IE                        183
#define CCP3IE                        184
#define CCP4IE                        185
#define CCP5IE                        186
#define OPTION_REG                    187
#define PS                            188
#define PS0                           189
#define PS1                           190
#define PS2                           191
#define PSA                           192
#define T0SE                          193
#define TMR0SE                        194
#define T0CS                          195
#define TMR0CS                        196
#define INTEDG                        197
#define nWPUEN                        198
#define PCON                          199
#define nBOR                          200
#define nPOR                          201
#define nRI                           202
#define nRMCLR                        203
#define STKUNF                        204
#define STKOVF                        205
#define WDTCON                        206
#define SWDTEN                        207
#define WDTPS                         208
#define WDTPS0                        209
#define WDTPS1                        210
#define WDTPS2                        211
#define WDTPS3                        212
#define WDTPS4                        213
#define OSCTUNE                       214
#define TUN0                          215
#define TUN                           216
#define TUN1                          217
#define TUN2                          218
#define TUN3                          219
#define TUN4                          220
#define TUN5                          221
#define OSCCON                        222
#define SCS0                          223
#define SCS                           224
#define SCS1                          225
#define IRCF                          226
#define IRCF0                         227
#define IRCF1                         228
#define IRCF2                         229
#define IRCF3                         230
#define SPLLEN                        231
#define OSCSTAT                       232
#define HFIOFS                        233
#define LFIOFR                        234
#define MFIOFR                        235
#define HFIOFL                        236
#define HFIOFR                        237
#define OSTS                          238
#define PLLR                          239
#define T1OSCR                        240
#define ADRESL                        241
#define ADRESH                        242
#define ADCON0                        243
#define ADON                          244
#define nDONE                         245
#define GO_nDONE                      246
#define GO                            247
#define ADGO                          248
#define CHS0                          249
#define CHS                           250
#define CHS1                          251
#define CHS2                          252
#define CHS3                          253
#define CHS4                          254
#define ADCON1                        255
#define ADPREF0                       256
#define ADPREF                        257
#define ADPREF1                       258
#define ADNREF                        259
#define ADCS0                         260
#define ADCS                          261
#define ADCS1                         262
#define ADCS2                         263
#define ADFM                          264
#define LATA                          265
#define LATA0                         266
#define LATA1                         267
#define LATA2                         268
#define LATA3                         269
#define LATA4                         270
#define LATA5                         271
#define LATA6                         272
#define LATA7                         273
#define LATB                          274
#define LATB0                         275
#define LATB1                         276
#define LATB2                         277
#define LATB3                         278
#define LATB4                         279
#define LATB5                         280
#define LATB6                         281
#define LATB7                         282
#define LATC                          283
#define LATC0                         284
#define LATC1                         285
#define LATC2                         286
#define LATC3                         287
#define LATC4                         288
#define LATC5                         289
#define LATC6                         290
#define LATC7                         291
#define LATE                          292
#define LATE3                         293
#define CM1CON0                       294
#define C1SYNC                        295
#define C1HYS                         296
#define C1SP                          297
#define C1POL                         298
#define C1OE                          299
#define C1OUT                         300
#define C1ON                          301
#define CM1CON1                       302
#define C1NCH0                        303
#define C1NCH                         304
#define C1NCH1                        305
#define C1PCH                         306
#define C1PCH0                        307
#define C1PCH1                        308
#define C1INTN                        309
#define C1INTP                        310
#define CM2CON0                       311
#define C2SYNC                        312
#define C2HYS                         313
#define C2SP                          314
#define C2POL                         315
#define C2OE                          316
#define C2OUT                         317
#define C2ON                          318
#define CM2CON1                       319
#define C2NCH0                        320
#define C2NCH                         321
#define C2NCH1                        322
#define C2PCH                         323
#define C2PCH0                        324
#define C2PCH1                        325
#define C2INTN                        326
#define C2INTP                        327
#define CMOUT                         328
#define MC1OUT                        329
#define MC2OUT                        330
#define BORCON                        331
#define BORRDY                        332
#define SBOREN                        333
#define FVRCON                        334
#define ADFVR0                        335
#define ADFVR                         336
#define ADFVR1                        337
#define CDAFVR0                       338
#define CDAFVR                        339
#define CDAFVR1                       340
#define TSRNG                         341
#define TSEN                          342
#define FVRRDY                        343
#define FVREN                         344
#define DACCON0                       345
#define DACNSS                        346
#define DACPSS                        347
#define DACPSS0                       348
#define DACPSS1                       349
#define DACOE                         350
#define DACLPS                        351
#define DACEN                         352
#define DACCON1                       353
#define DACR0                         354
#define DACR                          355
#define DACR1                         356
#define DACR2                         357
#define DACR3                         358
#define DACR4                         359
#define SRCON0                        360
#define SRPR                          361
#define SRPS                          362
#define SRNQEN                        363
#define SRQEN                         364
#define SRCLK0                        365
#define SRCLK                         366
#define SRCLK1                        367
#define SRCLK2                        368
#define SRLEN                         369
#define SRCON1                        370
#define SRRC1E                        371
#define SRRC2E                        372
#define SRRCKE                        373
#define SRRPE                         374
#define SRSC1E                        375
#define SRSC2E                        376
#define SRSCKE                        377
#define SRSPE                         378
#define APFCON                        379
#define CCP2SEL                       380
#define SSSEL                         381
#define C2OUTSEL                      382
#define SRNQSEL                       383
#define P2BSEL                        384
#define T1GSEL                        385
#define CCP3SEL                       386
#define ANSA0                         387
#define ANSELA                        388
#define ANSA1                         389
#define ANSA2                         390
#define ANSA3                         391
#define ANSA4                         392
#define ANSA5                         393
#define ANSB0                         394
#define ANSELB                        395
#define ANSB1                         396
#define ANSB2                         397
#define ANSB3                         398
#define ANSB4                         399
#define ANSB5                         400
#define EEADRL                        401
#define EEADRH                        402
#define EEDATL                        403
#define EEDATH                        404
#define EECON1                        405
#define RD                            406
#define WR                            407
#define WREN                          408
#define WRERR                         409
#define FREE                          410
#define LWLO                          411
#define CFGS                          412
#define EEPGD                         413
#define EECON2                        414
#define RCREG                         415
#define TXREG                         416
#define SP1BRGL                       417
#define SPBRGL                        418
#define SP1BRGH                       419
#define SPBRGH                        420
#define RCSTA                         421
#define RX9D                          422
#define OERR                          423
#define FERR                          424
#define ADDEN                         425
#define CREN                          426
#define SREN                          427
#define RX9                           428
#define SPEN                          429
#define TXSTA                         430
#define TX9D                          431
#define TRMT                          432
#define BRGH                          433
#define SENDB                         434
#define SYNC                          435
#define TXEN                          436
#define TX9                           437
#define CSRC                          438
#define BAUDCON                       439
#define ABDEN                         440
#define WUE                           441
#define BRG16                         442
#define SCKP                          443
#define RCIDL                         444
#define ABDOVF                        445
#define WPUB0                         446
#define WPUB                          447
#define WPUB1                         448
#define WPUB2                         449
#define WPUB3                         450
#define WPUB4                         451
#define WPUB5                         452
#define WPUB6                         453
#define WPUB7                         454
#define WPUE                          455
#define WPUE3                         456
#define SSPBUF                        457
#define SSPADD                        458
#define SSPMSK                        459
#define SSPSTAT                       460
#define BF                            461
#define UA                            462
#define R_nW                          463
#define S                             464
#define P                             465
#define D_nA                          466
#define CKE                           467
#define SMP                           468
#define SSPCON1                       469
#define SSPM0                         470
#define SSPM1                         471
#define SSPM2                         472
#define SSPM3                         473
#define CKP                           474
#define SSPEN                         475
#define SSPOV                         476
#define WCOL                          477
#define SSPCON2                       478
#define SEN                           479
#define RSEN                          480
#define PEN                           481
#define RCEN                          482
#define ACKEN                         483
#define ACKDT                         484
#define ACKSTAT                       485
#define GCEN                          486
#define SSPCON3                       487
#define DHEN                          488
#define AHEN                          489
#define SBCDE                         490
#define SDAHT                         491
#define BOEN                          492
#define SCIE                          493
#define PCIE                          494
#define ACKTIM                        495
#define CCPR1L                        496
#define CCPR1H                        497
#define CCP1CON                       498
#define CCP1M0                        499
#define CCP1M                         500
#define CCP1M1                        501
#define CCP1M2                        502
#define CCP1M3                        503
#define DC1B                          504
#define DC1B0                         505
#define DC1B1                         506
#define P1M                           507
#define P1M0                          508
#define P1M1                          509
#define PWM1CON                       510
#define P1DC0                         511
#define P1DC1                         512
#define P1DC2                         513
#define P1DC3                         514
#define P1DC4                         515
#define P1DC5                         516
#define P1DC6                         517
#define P1RSEN                        518
#define CCP1AS                        519
#define PSS1BD0                       520
#define PSS1BD1                       521
